{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int64", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3427, "output_dim": 50, "embeddings_initializer": {"class_name": "Constant", "config": {"value": [[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.013441000133752823, 0.23681999742984772, -0.16899000108242035, 0.4095099866390228, 0.6381199955940247, 0.4770900011062622, -0.42851999402046204, -0.556410014629364, -0.36399999260902405, -0.23938000202178955, 0.1300099939107895, -0.06373400241136551, -0.3957499861717224, -0.48162001371383667, 0.23291000723838806, 0.0902009978890419, -0.1332399994134903, 0.07863900065422058, -0.4163399934768677, -0.15428000688552856, 0.10068000108003616, 0.4889099895954132, 0.3122600018978119, -0.12520000338554382, -0.037512000650167465, -1.517899990081787, 0.12612000107765198, -0.02442000061273575, -0.0429610013961792, -0.2835099995136261, 3.541599988937378, -0.11956000328063965, -0.014533000066876411, -0.14990000426769257, 0.21863999962806702, -0.3341200053691864, -0.13872000575065613, 0.3180600106716156, 0.7035800218582153, 0.4485799968242645, -0.08026199787855148, 0.6300299763679504, 0.3211100101470947, -0.46764999628067017, 0.2278600037097931, 0.3603399991989136, -0.37817999720573425, -0.566569983959198, 0.04469100013375282, 0.3039200007915497], [0.4180000126361847, 0.24967999756336212, -0.41242000460624695, 0.1216999962925911, 0.3452700078487396, -0.044456999748945236, -0.4968799948692322, -0.17861999571323395, -0.0006602299981750548, -0.6565999984741211, 0.2784300148487091, -0.14767000079154968, -0.5567700266838074, 0.14657999575138092, -0.009509500116109848, 0.011657999828457832, 0.10204000025987625, -0.127920001745224, -0.8442999720573425, -0.12180999666452408, -0.016800999641418457, -0.33278998732566833, -0.15520000457763672, -0.23130999505519867, -0.1918099969625473, -1.8823000192642212, -0.7674599885940552, 0.09905099868774414, -0.42124998569488525, -0.19526000320911407, 4.0071001052856445, -0.1859399974346161, -0.5228700041770935, -0.3168100118637085, 0.0005921300034970045, 0.007444899994879961, 0.17778000235557556, -0.15896999835968018, 0.012040999718010426, -0.05422300100326538, -0.2987099885940552, -0.15749000012874603, -0.3475799858570099, -0.04563700035214424, -0.4425100088119507, 0.1878499984741211, 0.002784899901598692, -0.18411000072956085, -0.11513999849557877, -0.7858099937438965], [0.15163999795913696, 0.30177000164985657, -0.16763000190258026, 0.17684000730514526, 0.3171899914741516, 0.33972999453544617, -0.4347800016403198, -0.3108600080013275, -0.44999000430107117, -0.29486000537872314, 0.16607999801635742, 0.11963000148534775, -0.41328001022338867, -0.4235300123691559, 0.5986800193786621, 0.28824999928474426, -0.11546999961137772, -0.04184800013899803, -0.679889976978302, -0.2506299912929535, 0.1847199946641922, 0.08687599748373032, 0.4658200144767761, 0.015034999698400497, 0.043473999947309494, -1.4671000242233276, -0.3038400113582611, -0.023440999910235405, 0.3058899939060211, -0.217849999666214, 3.746000051498413, 0.004228400066494942, -0.18435999751091003, -0.46208998560905457, 0.09832900017499924, -0.11907000094652176, 0.2391899973154068, 0.1160999983549118, 0.41705000400543213, 0.056763000786304474, -6.368100002873689e-05, 0.06898699700832367, 0.08793900161981583, -0.10284999758005142, -0.13931000232696533, 0.22314000129699707, -0.08080299943685532, -0.35651999711990356, 0.016412999480962753, 0.1021599993109703], [0.2681800127029419, 0.1434600055217743, -0.27876999974250793, 0.016256999224424362, 0.1138399988412857, 0.6992300152778625, -0.5133200287818909, -0.4736799895763397, -0.3307499885559082, -0.13833999633789062, 0.2702000141143799, 0.3093799948692322, -0.4501200020313263, -0.41269999742507935, -0.09932000190019608, 0.03808499872684479, 0.029749000445008278, 0.10075999796390533, -0.2505800127983093, -0.5181800127029419, 0.34558001160621643, 0.4492200016975403, 0.4879100024700165, -0.0808660015463829, -0.10120999813079834, -1.3776999711990356, -0.10865999758243561, -0.23201000690460205, 0.0128389997407794, -0.46507999300956726, 3.846299886703491, 0.313620001077652, 0.13642999529838562, -0.5224400162696838, 0.3301999866962433, 0.3370699882507324, -0.35600998997688293, 0.3243100047111511, 0.1204100027680397, 0.35120001435279846, -0.06904300302267075, 0.3688499927520752, 0.2516799867153168, -0.245169997215271, 0.25380998849868774, 0.13670000433921814, -0.31178000569343567, -0.632099986076355, -0.2502799928188324, -0.3809700012207031], [0.6804699897766113, -0.03926299884915352, 0.3018600046634674, -0.17791999876499176, 0.42961999773979187, 0.032246001064777374, -0.4137600064277649, 0.13228000700473785, -0.29846999049186707, -0.08525300025939941, 0.17117999494075775, 0.22418999671936035, -0.1004600003361702, -0.4365299940109253, 0.33417999744415283, 0.6784600019454956, 0.057204000651836395, -0.3444800078868866, -0.42785000801086426, -0.43274998664855957, 0.5596299767494202, 0.1003199964761734, 0.1867700070142746, -0.26853999495506287, 0.03733399882912636, -2.0931999683380127, 0.2217099964618683, -0.3986800014972687, 0.2091200053691864, -0.5572500228881836, 3.8826000690460205, 0.4746600091457367, -0.9565799832344055, -0.3778800070285797, 0.20869000256061554, -0.3275200128555298, 0.12750999629497528, 0.08835899829864502, 0.16350999474525452, -0.21634000539779663, -0.09437499940395355, 0.018324000760912895, 0.2104800045490265, -0.030880000442266464, -0.19721999764442444, 0.08227899670600891, -0.0943399965763092, -0.07329700142145157, -0.06469900161027908, -0.26043999195098877], [0.2170500010251999, 0.46514999866485596, -0.4675700068473816, 0.10081999748945236, 1.0134999752044678, 0.748449981212616, -0.5310400128364563, -0.26256000995635986, 0.16811999678611755, 0.13181999325752258, -0.24909000098705292, -0.4418500065803528, -0.2173900008201599, 0.5100399851799011, 0.13447999954223633, -0.431410014629364, -0.031230000779032707, 0.20674000680446625, -0.7813799977302551, -0.20148000121116638, -0.09740100055932999, 0.16087999939918518, -0.6183599829673767, -0.18503999710083008, -0.12460999935865402, -2.2525999546051025, -0.22321000695228577, 0.5042999982833862, 0.32256999611854553, 0.15312999486923218, 3.963599920272827, -0.7136499881744385, -0.6701200008392334, 0.28387999534606934, 0.21738000214099884, 0.1443299949169159, 0.25925999879837036, 0.23433999717235565, 0.42739999294281006, -0.44451001286506653, 0.13812999427318573, 0.36972999572753906, -0.6428899765014648, 0.024142000824213028, -0.03931500017642975, -0.2603699862957001, 0.120169997215271, -0.04378199949860573, 0.41012999415397644, 0.17960000038146973], [0.7085300087928772, 0.5708799958229065, -0.4715999960899353, 0.1804800033569336, 0.5444899797439575, 0.7260299921035767, 0.18156999349594116, -0.523930013179779, 0.10380999743938446, -0.17565999925136566, 0.07885199785232544, -0.36215999722480774, -0.1182899996638298, -0.8333600163459778, 0.11917000263929367, -0.1660500019788742, 0.06155499815940857, -0.01271899975836277, -0.5662299990653992, 0.013616000302135944, 0.22851000726222992, -0.14395999908447266, -0.06754899770021439, -0.3815700113773346, -0.23698000609874725, -1.7036999464035034, -0.866919994354248, -0.2670400142669678, -0.258899986743927, 0.17669999599456787, 3.8675999641418457, -0.16130000352859497, -0.13273000717163086, -0.6888099908828735, 0.1844400018453598, 0.005246399901807308, -0.3387399911880493, -0.0789560005068779, 0.24185000360012054, 0.3657599985599518, -0.34727001190185547, 0.2848300039768219, 0.07569299638271332, -0.062178000807762146, -0.3898800015449524, 0.22901999950408936, -0.21616999804973602, -0.22562000155448914, -0.09391800314188004, -0.8037499785423279], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.6118299961090088, -0.22071999311447144, -0.10898000001907349, -0.052967000752687454, 0.5080400109291077, 0.3468399941921234, -0.3355799913406372, -0.19152000546455383, -0.03586500138044357, 0.10509999841451645, 0.07935000211000443, 0.24490000307559967, -0.4372999966144562, -0.33344000577926636, 0.5747900009155273, 0.6905199885368347, 0.2971299886703491, 0.09066899865865707, -0.5499200224876404, -0.461760014295578, 0.10113000124692917, -0.020239999517798424, 0.2847900092601776, 0.043512001633644104, 0.4573499858379364, -2.046600103378296, -0.580839991569519, 0.6179699897766113, 0.6517999768257141, -0.5826299786567688, 4.07859992980957, -0.2542000114917755, -0.14648999273777008, -0.34321001172065735, -0.2543700039386749, -0.4467700123786926, 0.12657000124454498, 0.28134000301361084, 0.133310005068779, -0.36974000930786133, 0.0500589981675148, -0.10057999938726425, -0.017906999215483665, 0.11141999810934067, -0.7179800271987915, 0.4909999966621399, -0.09997399896383286, -0.04368799924850464, -0.09792199730873108, 0.16806000471115112], [0.06038200110197067, 0.37821000814437866, -0.7514200210571289, -0.721589982509613, 0.5864800214767456, 0.7912600040435791, -0.7294700145721436, 0.682479977607727, -0.12998999655246735, -0.22988000512123108, 0.11595000326633453, 0.22427000105381012, -0.44679000973701477, -0.11514999717473984, 1.033400058746338, -0.088018998503685, -0.7853099703788757, 0.3430500030517578, -0.1145699992775917, -0.11905000358819962, 0.45882999897003174, 1.6332999467849731, 0.6854599714279175, 0.22307999432086945, 1.0098999738693237, -2.63319993019104, -0.5212799906730652, 0.25665000081062317, 0.023468000814318657, -0.8261600136756897, 3.1084001064300537, 0.27219000458717346, -0.2922700047492981, -0.47258999943733215, -0.12296999990940094, -0.13545000553131104, 0.11191999912261963, 0.8643800020217896, 0.3312099874019623, -0.966159999370575, -0.04478500038385391, -0.0667399987578392, 0.0030366999562829733, -0.3390499949455261, 0.0177839994430542, -0.5849900245666504, -0.005013999994844198, -1.2569999694824219, -0.06072299927473068, 0.42247000336647034], [0.3897300064563751, -0.21209999918937683, 0.5183699727058411, 0.801360011100769, 1.0335999727249146, -0.2778399884700775, -0.8452500104904175, -0.2533299922943115, 0.12586000561714172, -0.9034199714660645, 0.24975000321865082, 0.22021999955177307, -1.205299973487854, -0.5377100110054016, 1.044600009918213, 0.627780020236969, 0.3970400094985962, -0.15812000632286072, 0.3810200095176697, -0.5467399954795837, -0.44009000062942505, 1.097599983215332, 0.013069000095129013, -0.8997099995613098, 0.4122599959373474, -2.2309000492095947, 0.2899700105190277, 0.3217499852180481, -0.7273799777030945, -0.09224399924278259, 3.0280001163482666, -0.06259900331497192, 0.038329001516103745, 0.0072917998768389225, -0.35387998819351196, -0.9225599765777588, 0.09793200343847275, 0.10068000108003616, 1.2115999460220337, 0.8823300004005432, -0.46296998858451843, 1.318600058555603, 0.32705000042915344, -0.7344599962234497, 0.8930100202560425, -0.4532400071620941, -1.2697999477386475, 0.8611900210380554, 0.14149999618530273, 1.201799988746643], [-0.5840200185775757, 0.39030998945236206, 0.6528199911117554, -0.3402999937534332, 0.19493000209331512, -0.8348900079727173, 0.11929000169038773, -0.5729100108146667, -0.5684400200843811, 0.729889988899231, -0.5697500109672546, 0.5343599915504456, -0.38034000992774963, 0.22471000254154205, 0.9803100228309631, -0.29660001397132874, 0.12600000202655792, 0.5522199869155884, -0.6273699998855591, -0.08224199712276459, -0.08535899966955185, 0.3151499927043915, 0.9607700109481812, 0.3198600113391876, 0.8787800073623657, -1.5189000368118286, -1.7831000089645386, 0.35638999938964844, 0.9674000144004822, -1.5497000217437744, 2.3350000381469727, 0.849399983882904, -1.2371000051498413, 1.0622999668121338, -1.4266999959945679, -0.49055999517440796, 0.8546500205993652, -1.2877999544143677, 0.6020399928092957, -0.3596299886703491, 0.28586000204086304, -0.05216199904680252, -0.5081800222396851, -0.6345900297164917, 0.3388899862766266, 0.28415998816490173, -0.20340000092983246, -1.2338000535964966, 0.4671500027179718, 0.7885800004005432], [0.33041998744010925, 0.24995000660419464, -0.608739972114563, 0.10922999680042267, 0.036371998488903046, 0.1509999930858612, -0.5508300065994263, -0.07423900067806244, -0.09230700135231018, -0.3282099962234497, 0.09598000347614288, -0.8226900100708008, -0.3671700060367584, -0.6700900197029114, 0.4290899932384491, 0.016496000811457634, -0.23573000729084015, 0.12863999605178833, -1.0952999591827393, 0.43334001302719116, 0.5706700086593628, -0.10360000282526016, 0.2042199969291687, 0.07830800116062164, -0.427949994802475, -1.7984000444412231, -0.2786499857902527, 0.11953999847173691, -0.12689000368118286, 0.03174399957060814, 3.863100051879883, -0.17786000669002533, -0.08243399858474731, -0.6269800066947937, 0.26497000455856323, -0.05718500167131424, -0.07352100312709808, 0.4610300064086914, 0.30862000584602356, 0.12498000264167786, -0.4860900044441223, -0.008027199655771255, 0.0311840008944273, -0.3657599985599518, -0.42699000239372253, 0.421640008687973, -0.11665999889373779, -0.5070300102233887, -0.02727299928665161, -0.5328500270843506], [-0.001091900048777461, 0.33324000239372253, 0.35743001103401184, -0.5404099822044373, 0.8203200101852417, -0.493910014629364, -0.3258799910545349, 0.001997200073674321, -0.2382899969816208, 0.355540007352829, -0.6065499782562256, 0.9893199801445007, -0.21785999834537506, 0.11236000061035156, 1.149399995803833, 0.7328400015830994, 0.5118200182914734, 0.2928699851036072, 0.28387999534606934, -1.3589999675750732, -0.37950998544692993, 0.5094299912452698, 0.707099974155426, 0.6294100284576416, 1.0534000396728516, -2.175600051879883, -1.3203999996185303, 0.40000998973846436, 1.5741000175476074, -1.659999966621399, 3.7720999717712402, 0.8694900274276733, -0.804390013217926, 0.18389999866485596, -0.34332001209259033, 0.010714000090956688, 0.23969000577926636, 0.0667480006814003, 0.701170027256012, -0.7370200157165527, 0.2087700068950653, 0.11563999950885773, -0.15189999341964722, 0.8590800166130066, 0.22619999945163727, 0.16518999636173248, 0.36309000849723816, -0.4569700062274933, -0.048969000577926636, 1.131600022315979], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.08688800036907196, -0.19415999948978424, -0.2426699995994568, -0.3339099884033203, 0.5673099756240845, 0.3978300094604492, -0.9780899882316589, 0.03158999979496002, -0.6146900057792664, -0.3140600025653839, 0.5614500045776367, 0.1288599967956543, -0.8419299721717834, -0.46992000937461853, 0.4709700047969818, 0.02301199920475483, -0.5960900187492371, 0.22291000187397003, -1.1613999605178833, 0.3865000009536743, 0.06741199642419815, 0.4488300085067749, 0.1739400029182434, -0.5357400178909302, 0.1790899932384491, -2.1647000312805176, -0.1282700002193451, 0.2903600037097931, -0.15060999989509583, 0.35242000222206116, 3.124000072479248, -0.9008499979972839, -0.025669999420642853, -0.4170899987220764, 0.40564998984336853, -0.22702999413013458, 0.7682899832725525, 0.6098200082778931, 0.07006800174713135, -0.13270999491214752, -0.1200999990105629, 0.09613200277090073, -0.43998000025749207, -0.48530998826026917, -0.5188000202178955, -0.3077000081539154, -0.7502800226211548, -0.7699999809265137, 0.3944999873638153, -0.16936999559402466], [0.883870005607605, -0.14199000597000122, 0.13565999269485474, 0.09868200123310089, 0.512179970741272, 0.4913800060749054, -0.47154998779296875, -0.3074199855327606, 0.01962999999523163, 0.12685999274253845, 0.07352399826049805, 0.3583599925041199, -0.608739972114563, -0.18675999343395233, 0.7893499732017517, 0.5453400015830994, 0.11060000211000443, -0.2922999858856201, 0.05904100090265274, -0.6955100297927856, -0.18804000318050385, 0.19454999268054962, 0.3226900100708008, -0.49981001019477844, 0.3059999942779541, -2.390199899673462, -0.6074900031089783, 0.371069997549057, 0.07891199737787247, -0.23895999789237976, 3.8389999866485596, -0.20354999601840973, -0.3561300039291382, -0.6918500065803528, -0.17497000098228455, -0.35322999954223633, 0.10598000138998032, -0.0393030010163784, 0.01570099964737892, 0.03827900066971779, -0.3528299927711487, 0.44881999492645264, -0.16534000635147095, 0.31578999757766724, 0.14962999522686005, -0.07127700001001358, -0.5350599884986877, 0.5271099805831909, -0.20148000121116638, 0.009595200419425964], [0.20781999826431274, 0.12713000178337097, -0.30188000202178955, -0.23125000298023224, 0.3017500042915344, 0.3319399952888489, -0.5277600288391113, -0.440420001745224, -0.4834800064563751, 0.035020001232624054, 0.3478200137615204, 0.545740008354187, -0.20659999549388885, -0.08371300250291824, 0.24619999527931213, 0.1593099981546402, -0.0031349000055342913, 0.324429988861084, -0.4526999890804291, -0.22178000211715698, 0.022652000188827515, -0.04171400144696236, 0.31815001368522644, 0.08863300085067749, -0.03801000118255615, -1.8212000131607056, -0.5091699957847595, -0.09754399955272675, -0.08952999860048294, 0.05047599971294403, 3.7179999351501465, -0.16503000259399414, -0.07873299717903137, -0.5710099935531616, 0.20418000221252441, 0.1341100037097931, 0.0742809996008873, 0.08750200271606445, -0.25442999601364136, -0.15011000633239746, -0.15768000483512878, 0.3960599899291992, -0.23646000027656555, -0.09505400061607361, 0.07858999818563461, -0.012304999865591526, -0.4987899959087372, -0.35300999879837036, 0.05057999864220619, 0.019494999200105667], [0.13402999937534332, 0.8917800188064575, -0.7676100134849548, -0.6418399810791016, 0.8620399832725525, 1.3121999502182007, -0.6401799917221069, 0.8206700086593628, 0.3278299868106842, 0.021456999704241753, -0.09519399702548981, 0.40825000405311584, -0.6360200047492981, -0.018275000154972076, 0.6970800161361694, -0.29530999064445496, -1.1912000179290771, -0.23896999657154083, 0.3434099853038788, -0.331959992647171, 0.23702000081539154, 1.836400032043457, 0.1229500025510788, -0.18624000251293182, 0.8650299906730652, -2.635999917984009, -0.7791000008583069, 0.2029999941587448, 0.18985000252723694, -0.7989699840545654, 2.9881999492645264, 0.44336000084877014, -0.28367000818252563, -0.1958799958229065, 0.06187500059604645, 0.38558000326156616, -0.027621999382972717, 0.7184699773788452, 0.17156000435352325, -1.2167999744415283, 0.08163599669933319, 0.17293000221252441, -0.31718000769615173, -0.37038999795913696, 0.18976999819278717, -0.8917499780654907, 0.18491999804973602, -1.625100016593933, 0.03913399949669838, -0.1027899980545044], [0.2561599910259247, 0.4369400143623352, -0.11889000236988068, 0.20344999432563782, 0.4195899963378906, 0.8586300015449524, -0.60343998670578, -0.3183499872684479, -0.6718000173568726, 0.003984000068157911, -0.0751589983701706, 0.11043000221252441, -0.7353399991989136, 0.2743600010871887, 0.05401499941945076, -0.23827999830245972, -0.13766999542713165, 0.011572999879717827, -0.46623000502586365, -0.5523300170898438, 0.08331699669361115, 0.5593799948692322, 0.519029974937439, -0.2706499993801117, -0.2821100056171417, -1.391800045967102, 0.17497999966144562, 0.265859991312027, 0.061448998749256134, -0.27300000190734863, 3.9031999111175537, 0.38168999552726746, -0.056008998304605484, -0.004424999933689833, 0.24032999575138092, 0.30674999952316284, -0.12637999653816223, 0.3343600034713745, 0.075484998524189, -0.03621799871325493, 0.13691000640392303, 0.37762001156806946, -0.12159000337123871, -0.13808000087738037, 0.19505000114440918, 0.2279299944639206, -0.1730400025844574, -0.07573000341653824, -0.25867998600006104, -0.3933899998664856], [-0.37915000319480896, 0.6184800267219543, 0.9592999815940857, 0.9040300250053406, 0.36805999279022217, 0.022972000762820244, 0.16795000433921814, -1.530900001525879, -0.06053299829363823, -0.25, 0.1503099948167801, 0.3196699917316437, -0.6891400218009949, -0.7862600088119507, -0.015824999660253525, 0.5053099989891052, -0.8472999930381775, -0.12353000044822693, 0.07852599769830704, -0.9602400064468384, -0.5431299805641174, -0.3351599872112274, 0.3893199861049652, 0.19460999965667725, -1.1687999963760376, -0.8660799860954285, -0.39177998900413513, 0.2418300062417984, 0.32861998677253723, -0.7875499725341797, 2.4883999824523926, 0.7101500034332275, -0.5311400294303894, 0.8959299921989441, -0.2305299937725067, -0.8202300071716309, 0.34424999356269836, -0.9686599969863892, -0.15142999589443207, -0.4491199851036072, 0.8951299786567688, -0.016589999198913574, -0.27489998936653137, 0.2794800102710724, 0.7793599963188171, -0.31944000720977783, 0.16755999624729156, -0.6251500248908997, 0.05332300066947937, 0.6202300190925598], [0.27724000811576843, 0.88468998670578, -0.262470006942749, 0.08410400152206421, 0.4081299901008606, -1.169700026512146, -0.6852200031280518, 0.14270000159740448, -0.5734500288963318, -0.5857499837875366, -0.5083400011062622, -0.864109992980957, -0.5259600281715393, -0.5637900233268738, 0.32861998677253723, 0.43393000960350037, -0.21247999370098114, 0.49364998936653137, -1.8136999607086182, -0.03574100136756897, 1.322700023651123, 0.808650016784668, 0.012217000126838684, -0.0870169997215271, -0.16812999546527863, -1.593500018119812, 0.4703400135040283, 0.26096999645233154, -0.41666001081466675, -0.3852599859237671, 3.4412999153137207, 0.3438299894332886, -0.03589500114321709, -0.567799985408783, 0.18377000093460083, -0.4864700138568878, 0.42645999789237976, 0.4408000111579895, 1.0930999517440796, 0.06391499936580658, -0.06430500000715256, -0.2923099994659424, 0.08650200068950653, 0.35245001316070557, 0.1789100021123886, 0.25940999388694763, 0.3706899881362915, -0.5161100029945374, 0.023163000121712685, 0.05778999999165535], [-0.15233999490737915, 0.9808499813079834, 1.006500005722046, 0.9781200289726257, 0.6628000140190125, 0.11185000091791153, 0.6548600196838379, -0.4758700132369995, 0.14584000408649445, 0.0882209986448288, -0.013396999798715115, -0.02802399918437004, -0.6757400035858154, -0.04159900173544884, 0.16137999296188354, -0.04044700041413307, -0.47119998931884766, 0.013283999636769295, -0.631380021572113, 0.22265000641345978, -0.05153900012373924, 0.03387799859046936, -0.21628999710083008, 0.03611199930310249, -0.07055699825286865, -1.229099988937378, -0.17636999487876892, -0.09300599992275238, -0.07129000127315521, 0.4065999984741211, 2.5373001098632812, 0.05640999972820282, -0.17576000094413757, 0.8538200259208679, 0.0701960027217865, -0.8482800126075745, 0.14811000227928162, -1.101099967956543, -0.074583999812603, -0.7663599848747253, 0.3642500042915344, -0.05707300081849098, 0.31338000297546387, -0.6712700128555298, -0.12431000173091888, 0.465719997882843, 0.305759996175766, 0.0378430001437664, 0.7174400091171265, 0.3243499994277954], [-0.14577999711036682, 0.5045899748802185, 0.04752499982714653, -0.46463000774383545, 0.44249001145362854, -0.1677200049161911, -0.40334001183509827, -0.39223000407218933, -0.4154300093650818, 0.27636998891830444, -0.6302700042724609, 0.6903300285339355, -0.45440998673439026, 0.0015844999579712749, 1.312000036239624, 0.5241299867630005, 0.37380000948905945, 0.2815600037574768, -0.004056300036609173, -0.526639997959137, -0.570609986782074, 0.3656100034713745, 0.5917400121688843, 0.3471300005912781, 0.4500899910926819, -2.145400047302246, -1.3795000314712524, 0.3070000112056732, 1.4875999689102173, -0.963129997253418, 2.8403000831604004, 0.5024700164794922, -0.8675199747085571, 0.06413000077009201, -0.36375999450683594, -0.1401900053024292, 0.1197500005364418, -0.04544200003147125, 0.7268199920654297, -0.44446998834609985, -0.27226001024246216, 0.15029999613761902, 0.11489000171422958, 0.712369978427887, 0.11341000348329544, 0.22834999859333038, -0.040800999850034714, -0.41468000411987305, 0.1105400025844574, 1.1680999994277954], [0.30044999718666077, 0.25005999207496643, -0.166920006275177, 0.1923000067472458, 0.026921000331640244, -0.07948599755764008, -0.9138299822807312, -0.19740000367164612, -0.05341299995779991, -0.40845999121665955, -0.26844000816345215, -0.2821199893951416, -0.5, 0.12210000306367874, 0.3903000056743622, 0.1779700070619583, -0.44290000200271606, -0.40478000044822693, -0.9505000114440918, -0.1689700037240982, 0.7779300212860107, 0.33524999022483826, 0.3346000015735626, -0.1754000037908554, -0.120169997215271, -1.7861000299453735, 0.2924099862575531, 0.5593299865722656, 0.029982000589370728, -0.32416999340057373, 3.9296998977661133, 0.1088000014424324, -0.5733500123023987, -0.17842000722885132, 0.004174800124019384, -0.16309000551700592, 0.45076999068260193, -0.16122999787330627, -0.1731099933385849, -0.08788900077342987, -0.08903200179338455, 0.062001001089811325, -0.1994599997997284, -0.3886300027370453, -0.1823199987411499, 0.06075099855661392, 0.09860300272703171, -0.07130999863147736, 0.23051999509334564, -0.5193899869918823], [0.19253000617027283, 0.10006000101566315, 0.06379800289869308, -0.08766400068998337, 0.5221700072288513, 0.3910500109195709, -0.41975000500679016, -0.45671001076698303, -0.34053000807762146, -0.11174999922513962, 0.01475400011986494, 0.3173399865627289, -0.5085300207138062, -0.11559999734163284, 0.7430300116539001, 0.0976179987192154, 0.3440699875354767, -0.12129999697208405, -0.16937999427318573, -0.8408799767494202, -0.1123099997639656, 0.40601998567581177, 0.7680100202560425, 0.09113799780607224, 0.10781999677419662, -1.267300009727478, -0.5770900249481201, -0.36208000779151917, 0.3482399880886078, -0.754580020904541, 4.042600154876709, 0.9496700167655945, -0.2266799956560135, -0.35776999592781067, 0.34130001068115234, 0.13072000443935394, 0.23045000433921814, -0.036997001618146896, -0.2588900029659271, 0.12976999580860138, -0.39030998945236206, -0.04960700124502182, 0.4576599895954132, 0.5678200125694275, -0.461650013923645, 0.41933000087738037, -0.5491999983787537, 0.08119100332260132, -0.3048500120639801, -0.3051300048828125], [-0.11603999882936478, 1.142899990081787, 0.0260429996997118, -0.008492100052535534, 0.31898000836372375, 0.6598399877548218, -0.2505500018596649, -0.983680009841919, -0.8333399891853333, -0.21146999299526215, -0.37307000160217285, 0.41227999329566956, 0.029478000476956367, -0.4216200113296509, 0.2682900130748749, -0.38260000944137573, -0.2670400142669678, -0.1755100041627884, -0.6998599767684937, 0.08844000101089478, -0.05784999951720238, 0.14381000399589539, 0.4337199926376343, 0.3184100091457367, -0.28404998779296875, -0.9644500017166138, 0.09618999809026718, -0.530460000038147, 0.5912200212478638, -0.4278799891471863, 3.3691999912261963, 0.0676259994506836, -0.10390999913215637, -0.04791399836540222, 0.1131799966096878, -0.05632200092077255, 0.14699000120162964, 0.057050999253988266, 1.027500033378601, 0.41662999987602234, 0.6981800198554993, 0.5468199849128723, 0.9114800095558167, -0.2665500044822693, -0.3526799976825714, 1.104200005531311, 0.07405800372362137, -0.8676499724388123, 0.07496900111436844, 0.8039500117301941], [0.6034799814224243, -0.5209599733352661, 0.4085099995136261, -0.37217000126838684, 0.3697800040245056, 0.6108199954032898, -1.3228000402450562, 0.24375000596046448, -0.5942000150680542, -0.35708001255989075, 0.39941999316215515, 0.03191100060939789, -1.0642999410629272, -0.5232700109481812, 0.7145299911499023, 0.06338399648666382, -0.46382999420166016, -0.34641000628471375, -0.7244499921798706, -0.13714000582695007, -0.19178999960422516, 0.7222499847412109, 0.6294999718666077, -0.8086000084877014, -0.03769399970769882, -2.0355000495910645, 0.10565999895334244, -0.03859100118279457, -0.23201000690460205, -0.2962700128555298, 3.321500062942505, 0.03244299814105034, 0.08536799997091293, -0.4077099859714508, 0.45340999960899353, -0.09967400133609772, 0.44703999161720276, 0.5422000288963318, 0.18185000121593475, 0.17504000663757324, -0.3383300006389618, 0.31696999073028564, -0.02526799961924553, 0.09579499810934067, -0.25071001052856445, -0.4756399989128113, -1.0406999588012695, -0.1513800024986267, -0.22056999802589417, -0.5963299870491028], [0.9110199809074402, -0.22871999442577362, 0.2076999992132187, -0.20237000286579132, 0.5069699883460999, -0.05789300054311752, -0.41729000210762024, -0.07534100115299225, -0.3045400083065033, -0.003286000108346343, 0.44481000304222107, 0.418179988861084, -0.334089994430542, 0.032917000353336334, 0.9887199997901917, 0.9198399782180786, 0.4052099883556366, 0.01924999989569187, -0.10520000010728836, -0.7986500263214111, -0.36403000354766846, -0.0879950001835823, 0.7218199968338013, 0.11113999783992767, 0.21529999375343323, -1.941100001335144, -0.2637600004673004, 0.445499986410141, 0.2758600115776062, -0.21104000508785248, 4.021200180053711, -0.06194299831986427, -0.32133999466896057, -0.8192200064659119, 0.21080000698566437, -0.20413999259471893, 0.7262499928474426, 0.47516998648643494, -0.3985300064086914, -0.3916800022125244, -0.3458099961280823, 0.02592799998819828, 0.13072000443935394, 0.7356200218200684, -0.15198999643325806, -0.18438999354839325, -0.671280026435852, 0.166920006275177, -0.05006299912929535, 0.19241000711917877], [0.5502499938011169, -0.24942000210285187, -0.0009385999874211848, -0.2639999985694885, 0.5932000279426575, 0.27950000762939453, -0.25666001439094543, 0.09307599812746048, -0.36287999153137207, 0.0907759964466095, 0.2840900123119354, 0.7133700251579285, -0.47510001063346863, -0.2441300004720688, 0.8842399716377258, 0.8910899758338928, 0.4300900101661682, -0.2732999920845032, 0.11275999993085861, -0.8166499733924866, -0.4127199947834015, 0.17754000425338745, 0.6194199919700623, 0.10465999692678452, 0.33327001333236694, -2.3125, -0.5237100124359131, -0.021897999569773674, 0.5380100011825562, -0.5061500072479248, 3.868299961090088, 0.16641999781131744, -0.7198100090026855, -0.7472800016403198, 0.1163100004196167, -0.37584999203681946, 0.5551999807357788, 0.12675000727176666, -0.22642000019550323, -0.10175000131130219, -0.35455000400543213, 0.12347999960184097, 0.1653199940919876, 0.704200029373169, -0.08023100346326828, -0.06840600073337555, -0.6762599945068359, 0.3376300036907196, 0.05013899877667427, 0.3346500098705292], [0.15272000432014465, 0.36180999875068665, -0.22168000042438507, 0.06605099886655807, 0.13029000163078308, 0.3707500100135803, -0.7587400078773499, -0.44721999764442444, 0.2256300002336502, 0.10208000242710114, 0.054225001484155655, 0.1349399983882904, -0.4305199980735779, -0.2134000062942505, 0.5613899827003479, -0.21445000171661377, 0.07797399908304214, 0.10136999934911728, -0.5130599737167358, -0.4029499888420105, 0.4063900113105774, 0.23308999836444855, 0.20695999264717102, -0.12668000161647797, -0.5063400268554688, -1.7130999565124512, 0.07718300074338913, -0.3913800120353699, -0.10593999922275543, -0.23743000626564026, 3.955199956893921, 0.6659600138664246, -0.6184099912643433, -0.32679998874664307, 0.3702099919319153, 0.25764000415802, 0.3897700011730194, 0.2712100148200989, 0.04302399978041649, -0.3432199954986572, 0.02033899910748005, 0.2142000049352646, 0.04409699887037277, 0.14002999663352966, -0.20079000294208527, 0.07479400187730789, -0.36076000332832336, 0.4338200092315674, -0.0846169963479042, 0.12139999866485596], [0.5307400226593018, 0.4011699855327606, -0.4078499972820282, 0.1544400006532669, 0.4778200089931488, 0.20754000544548035, -0.2695100009441376, -0.34022998809814453, -0.10879000276327133, 0.10563000291585922, -0.1028899997472763, 0.1084899976849556, -0.4968099892139435, -0.2512800097465515, 0.8402500152587891, 0.389490008354187, 0.32284000515937805, -0.22797000408172607, -0.4434199929237366, -0.3164899945259094, -0.1240599974989891, -0.2816999852657318, 0.19467000663280487, 0.05551299825310707, 0.5670499801635742, -1.7418999671936035, -0.9114500284194946, 0.27035999298095703, 0.41927000880241394, 0.02027899958193302, 4.040500164031982, -0.24943000078201294, -0.20416000485420227, -0.6276199817657471, -0.05478300154209137, -0.26883000135421753, 0.1844400018453598, 0.1820400059223175, -0.23535999655723572, -0.16155000030994415, -0.2765499949455261, 0.0355059988796711, -0.38210999965667725, -0.000751340005081147, -0.24821999669075012, 0.2816399931907654, 0.12818999588489532, 0.28762000799179077, 0.1444000005722046, 0.23611000180244446], [0.26357999444007874, 0.18747000396251678, 0.04439400136470795, -0.19119000434875488, 0.45454999804496765, 0.6644499897956848, 0.2585499882698059, -0.648859977722168, -0.6765300035476685, 0.045253999531269073, 0.0710809975862503, 0.3644999861717224, 0.7486299872398376, -0.17488999664783478, 0.2872300148010254, 0.4327700138092041, -0.39184001088142395, -0.0485679991543293, -0.21373000741004944, -0.7299200296401978, 0.13901999592781067, -0.23307999968528748, 0.7025600075721741, 0.2176000028848648, -0.20646999776363373, -1.4149999618530273, -0.32587000727653503, -0.0750190019607544, 0.8853600025177002, -0.566789984703064, 4.029600143432617, 0.01980300061404705, -0.5725899934768677, -0.060878001153469086, 0.14666999876499176, 0.1653199940919876, 0.21187999844551086, -0.3835799992084503, 0.427480012178421, -0.09692099690437317, 0.1928499937057495, 0.021779000759124756, 0.5856199860572815, 0.9763299822807312, 0.2038400024175644, -0.21619999408721924, -0.02148599922657013, -0.4293600022792816, 0.5287899971008301, -0.12598000466823578], [0.5704900026321411, -0.0077853999100625515, -0.7076600193977356, -0.3178499937057495, 0.8949300050735474, -0.016127999871969223, -0.06714899837970734, 0.15764999389648438, -0.4983200132846832, 0.2584500014781952, 0.10943000018596649, 0.3672800064086914, -0.1484300047159195, 0.06328599900007248, 0.2083200067281723, 0.459199994802475, 0.7178099751472473, 0.2277200073003769, -0.001534900045953691, -0.9309300184249878, -0.8004800081253052, 0.46713998913764954, 0.4157100021839142, 0.1757200062274933, 1.0875999927520752, -1.6116000413894653, -0.7094299793243408, 0.8377199769020081, 0.6708099842071533, 0.18139000236988068, 3.9899001121520996, -0.10270000249147415, 0.4390000104904175, -0.6792600154876709, 0.11861000210046768, -0.2018200010061264, -0.08160299807786942, 0.9073899984359741, -0.5225800275802612, -0.4842599928379059, -0.3132599890232086, 0.10324999690055847, 0.13036000728607178, 0.3511500060558319, 0.3759300112724304, 0.06438799947500229, -0.22589999437332153, 0.07912500202655792, 0.1257299929857254, 0.839389979839325], [0.35934001207351685, -0.26570001244544983, -0.046477001160383224, -0.24959999322891235, 0.5467600226402283, 0.2592400014400482, -0.6445800065994263, 0.1736000031232834, -0.5305600166320801, 0.13942000269889832, 0.06232399865984917, 0.18458999693393707, -0.7549499869346619, -0.19569000601768494, 0.7079899907112122, 0.4475899934768677, 0.27031001448631287, -0.32885000109672546, -0.3889099955558777, -0.6160600185394287, -0.48399999737739563, 0.41703000664711, 0.34793999791145325, -0.1970600038766861, 0.40733999013900757, -2.1487998962402344, -0.2428400069475174, 0.3380900025367737, 0.4399299919605255, -0.21615999937057495, 3.7634999752044678, 0.19001999497413635, -0.12502999603748322, -0.38227999210357666, 0.12943999469280243, -0.18272000551223755, 0.07680299878120422, 0.5157899856567383, 0.007251599803566933, -0.291920006275177, -0.2752299904823303, 0.4059300124645233, -0.040394000709056854, 0.28352999687194824, -0.024723999202251434, 0.10563000291585922, -0.32879000902175903, 0.10672999918460846, -0.11502999812364578, 0.07467799633741379], [0.7083500027656555, -0.5736100077629089, 0.1537500023841858, -0.6333500146865845, 0.4687899947166443, -0.06656599789857864, -0.8682600259780884, 0.3596700131893158, -0.6478599905967712, -0.2252500057220459, 0.09752000123262405, 0.277319997549057, -0.35175999999046326, -0.259550005197525, 0.6236799955368042, 0.608240008354187, 0.34904998540878296, -0.27195000648498535, -0.27981001138687134, -1.0183000564575195, -0.14869999885559082, 0.4193199872970581, 1.0341999530792236, 0.17782999575138092, 0.13569000363349915, -1.999899983406067, -0.5616300106048584, 0.004017999861389399, 0.6083899736404419, -1.003100037574768, 3.9546000957489014, 0.6869800090789795, -0.5359299778938293, -0.7426999807357788, 0.18077999353408813, 0.0345270000398159, 0.016025999560952187, 0.12466999888420105, -0.0846330001950264, -0.10374999791383743, -0.4786199927330017, -0.22314000129699707, 0.2548699975013733, 0.6998500227928162, 0.3271400034427643, -0.157260000705719, -0.620199978351593, -0.23113000392913818, -0.31216999888420105, -0.30489999055862427], [0.17639000713825226, 0.2711299955844879, -0.607450008392334, -0.701740026473999, 0.4913800060749054, 0.014926999807357788, -0.47620999813079834, 0.2530899941921234, -0.43156999349594116, 0.23225000500679016, -0.5349699854850769, 0.43511998653411865, 0.16218000650405884, -0.319489985704422, 0.29499000310897827, 0.30629000067710876, 0.41196998953819275, 0.1911499947309494, -0.31937000155448914, -0.8253099918365479, -0.3269299864768982, 0.38596999645233154, 0.22799000144004822, -0.06341899931430817, 0.5751799941062927, -1.7480000257492065, -1.0286999940872192, 0.9494600296020508, 1.027500033378601, -0.5310400128364563, 3.3557000160217285, 0.3138999938964844, 0.29872000217437744, 0.10097000002861023, 0.13237999379634857, -0.07951000332832336, -0.48739001154899597, -0.032861001789569855, 0.3973200023174286, -1.0369999408721924, -0.29017001390457153, 0.3168100118637085, -0.17499999701976776, 0.17036999762058258, 0.2029000073671341, 0.04210299998521805, 0.23784999549388885, -0.29109999537467957, 5.270000110613182e-05, 0.49024999141693115], [0.6184999942779541, 0.6425399780273438, -0.4655199944972992, 0.3756999969482422, 0.7483800053596497, 0.5373899936676025, 0.0022239000536501408, -0.6057699918746948, 0.2640799880027771, 0.11703000217676163, 0.4372200071811676, 0.2009200006723404, -0.05785899981856346, -0.34588998556137085, 0.21663999557495117, 0.5857300162315369, 0.5391899943351746, 0.6948999762535095, -0.1561799943447113, 0.05583000183105469, -0.6051499843597412, -0.2899700105190277, -0.02559399977326393, 0.5559300184249878, 0.25356000661849976, -1.9611999988555908, -0.5138099789619446, 0.6909599900245667, 0.06624600291252136, -0.05422399938106537, 3.787100076675415, -0.7740300297737122, -0.12689000368118286, -0.5146499872207642, 0.06670500338077545, -0.3293299973011017, 0.13482999801635742, 0.1904900074005127, 0.13811999559402466, -0.2150299996137619, -0.016573000699281693, 0.31200000643730164, -0.3318899869918823, -0.02600100077688694, -0.38203001022338867, 0.1940300017595291, -0.12466000020503998, -0.27557000517845154, 0.3089900016784668, 0.48497000336647034], [0.6030799746513367, -0.32023999094963074, 0.088857002556324, -0.5517600178718567, 0.5318199992179871, 0.0470689982175827, -0.3624599874019623, 0.005701799876987934, -0.37665000557899475, 0.22533999383449554, -0.13534000515937805, 0.3598800003528595, -0.42517998814582825, 0.07132399827241898, 0.7706500291824341, 0.5671200156211853, 0.4122599959373474, 0.12450999766588211, 0.14229999482631683, -0.9653499722480774, -0.390529990196228, 0.34198999404907227, 0.5696899890899658, 0.03163500130176544, 0.6946499943733215, -1.9215999841690063, -0.671180009841919, 0.5797100067138672, 0.8608800172805786, -0.5910500288009644, 3.778700113296509, 0.30430999398231506, -0.04310299828648567, -0.4239799976348877, -0.06391499936580658, -0.06682199984788895, 0.06198300048708916, 0.563319981098175, -0.22335000336170197, -0.4738599956035614, -0.4702099859714508, 0.09171400219202042, 0.14778000116348267, 0.6380500197410583, -0.1435600072145462, -0.002292799996212125, -0.3149999976158142, -0.2518700063228607, -0.26879000663757324, 0.36656999588012695], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.3211199939250946, -0.6930599808692932, 0.4792200028896332, -0.546019971370697, 0.28352001309394836, 0.2034599930047989, -0.9844499826431274, -0.14102999866008759, -0.1314699947834015, -0.08597499877214432, -0.4950900077819824, 0.0027600000612437725, -1.117300033569336, 0.3372899889945984, 0.6131200194358826, -0.06711000204086304, 0.3537999987602234, -0.35183000564575195, -0.5819100141525269, -0.6952499747276306, -0.025032000616192818, 0.6167500019073486, 0.7852200269699097, -0.19594000279903412, 0.2632400095462799, -1.8976000547409058, 0.1464499980211258, 0.4888499975204468, 0.618179976940155, -1.0119999647140503, 3.7284998893737793, 0.6661499738693237, -0.3336400091648102, 0.3189600110054016, -0.15173999965190887, 0.30979999899864197, 0.04966999962925911, 0.2714399993419647, 0.34595000743865967, -0.08184999972581863, -0.3746899962425232, 0.39980998635292053, 0.08492500334978104, 0.3123700022697449, -0.1267700046300888, 0.03632200136780739, -0.06953299790620804, -0.43547001481056213, -0.11079999804496765, -0.5849999785423279], [-0.2009200006723404, -0.0602709986269474, -0.6176599860191345, -0.8443999886512756, 0.5781000256538391, 0.14670999348163605, -0.8609799742698669, 0.6704999804496765, -0.865559995174408, -0.18233999609947205, 0.15855999290943146, 0.45813998579978943, -1.0162999629974365, -0.3587400019168854, 0.7386900186538696, -0.24048000574111938, -0.33893001079559326, 0.25742000341415405, -0.7819200158119202, 0.08352799713611603, 0.17749999463558197, 0.9177299737930298, 0.6453099846839905, -0.19896000623703003, 0.3741599917411804, -2.752500057220459, -0.09158600121736526, 0.040348999202251434, -0.06479199975728989, -0.3146600127220154, 3.394399881362915, 0.0449410006403923, -0.5503799915313721, -0.6533399820327759, 0.10435999929904938, 0.016394000500440598, 0.2438800036907196, 1.0084999799728394, 0.31411999464035034, -0.3380599915981293, -0.1692499965429306, 0.10227999836206436, -0.621429979801178, 0.19829000532627106, -0.3614700138568878, -0.24769000709056854, -0.38988998532295227, -0.33316999673843384, -0.041659001260995865, -0.01317100040614605], [0.03228599950671196, -0.2707099914550781, 0.6810799837112427, -0.27941998839378357, 0.5796999931335449, -0.008109699934720993, -0.8279200196266174, -0.5334200263023376, -0.4785099923610687, -0.06825599819421768, -0.46963998675346375, -0.31716999411582947, -0.49371999502182007, 0.09808000177145004, 0.4996100068092346, 0.2730500102043152, 0.09992200136184692, -0.16147999465465546, -0.6995199918746948, -0.7043499946594238, 0.5908399820327759, 0.6203100085258484, 0.3046700060367584, -0.4157800078392029, -0.022199999541044235, -1.6311999559402466, 0.5467600226402283, 0.2575399875640869, 0.44541001319885254, -0.7279899716377258, 3.912899971008301, 0.8007500171661377, -0.18839000165462494, 0.42434999346733093, 0.03920700028538704, -0.09393899887800217, -0.3951599895954132, 0.20975999534130096, 0.5948799848556519, -0.39070001244544983, -0.3155499994754791, 0.24074000120162964, 0.41694000363349915, 0.10414999723434448, -0.04430500045418739, -0.09516000002622604, 0.25464001297950745, -0.5669900178909302, 0.033215999603271484, -0.5812299847602844], [0.8946599960327148, 0.3660399913787842, 0.37588000297546387, -0.418179988861084, 0.5846199989318848, 0.1859399974346161, -0.4190700054168701, -0.4662100076675415, -0.5490300059318542, 0.024769999086856842, -0.9081599712371826, -0.48271000385284424, -0.050742000341415405, -0.7403900027275085, 1.4377000331878662, -0.019740000367164612, -0.23839999735355377, 0.43154001235961914, -0.6611999869346619, -0.4127500057220459, 0.25475001335144043, 0.9349799752235413, 0.8140400052070618, -0.17295999825000763, 0.6129599809646606, -1.847499966621399, -0.27616000175476074, 0.2770099937915802, 0.42346999049186707, -0.11598999798297882, 3.624300003051758, 0.12306000292301178, -0.02352599985897541, -0.24842999875545502, -0.2237599939107895, -0.5394099950790405, -0.6244400143623352, -0.2771100103855133, 0.4940600097179413, 0.02023399993777275, -0.2345999926328659, 0.4451200067996979, 0.5339699983596802, 0.6665400266647339, -0.09366200119256973, -0.0352029986679554, -0.06419400125741959, 0.5599799752235413, -0.6659299731254578, 0.12177000194787979], [0.31474000215530396, 0.4166199862957001, 0.1348000019788742, 0.15853999555110931, 0.8881199955940247, 0.43316999077796936, -0.5591599941253662, 0.030476000159978867, -0.14622999727725983, -0.1427299976348877, -0.17949000000953674, -0.17342999577522278, -0.4926399886608124, 0.26774999499320984, 0.48798999190330505, -0.2953700125217438, 0.18485000729560852, 0.1493699997663498, -0.7500900030136108, -0.3565100133419037, -0.23699000477790833, 0.18490000069141388, 0.17237000167369843, 0.23611000180244446, 0.14077000319957733, -1.9031000137329102, -0.6535300016403198, -0.02253899909555912, 0.1038300022482872, -0.4370500147342682, 3.7809998989105225, -0.04407700151205063, -0.04664300009608269, 0.02727399952709675, 0.5188300013542175, 0.13353000581264496, 0.2323099970817566, 0.25598999857902527, 0.06088799983263016, -0.06561800092458725, -0.15556000173091888, 0.3081800043582916, -0.09358599781990051, 0.33296000957489014, -0.14612999558448792, 0.016332000494003296, -0.24251000583171844, -0.2052599936723709, 0.07009000331163406, -0.11568000167608261], [0.45322999358177185, 0.059810999780893326, -0.10576999932527542, -0.3330000042915344, 0.7235900163650513, -0.08716999739408493, -0.6105300188064575, -0.03769500181078911, -0.3094500005245209, 0.2180500030517578, -0.4360499978065491, 0.47317999601364136, -0.7686600089073181, -0.27129998803138733, 1.104200005531311, 0.5914099812507629, 0.5696200132369995, -0.18678000569343567, 0.1486700028181076, -0.6729199886322021, -0.34672001004219055, 0.5228400230407715, 0.22958999872207642, -0.07201399654150009, 0.9396700263023376, -2.3984999656677246, -1.323799967765808, 0.286980003118515, 0.7550899982452393, -0.7652199864387512, 3.3424999713897705, 0.17233000695705414, -0.5180299878120422, -0.8296999931335449, -0.29333001375198364, -0.500760018825531, -0.15228000283241272, 0.09897299855947495, 0.18145999312400818, -0.17419999837875366, -0.4066599905490875, 0.20348000526428223, -0.011788000352680683, 0.4825200140476227, 0.024598000571131706, 0.34064000844955444, -0.08472400158643723, 0.5324000120162964, -0.25102999806404114, 0.6254600286483765], [-0.1981000006198883, -0.7084699869155884, 0.8585699796676636, -0.48107999563217163, 0.5156199932098389, -0.2892400026321411, -0.6431099772453308, -0.4196600019931793, -0.6871799826622009, -0.12307000160217285, -0.4459399878978729, -0.3522599935531616, -0.8482599854469299, 0.1296200007200241, 0.2000499963760376, 0.4891600012779236, -0.20257000625133514, -0.5334100127220154, -0.9619600176811218, -0.6768100261688232, 0.6980800032615662, 0.5059900283813477, 0.24011999368667603, -0.7281299829483032, 0.11395999789237976, -1.825600028038025, 0.8098000288009644, 0.6500700116157532, 0.7311099767684937, -0.503250002861023, 3.5864999294281006, 0.3090600073337555, -0.14279000461101532, 0.6753000020980835, -0.07405900210142136, -0.45274001359939575, -0.28001001477241516, -0.20383000373840332, 0.6104400157928467, -0.2487500011920929, -0.47409000992774963, 0.25916001200675964, 0.4152199923992157, 0.15244999527931213, 0.093190997838974, -0.09190600365400314, 0.4008199870586395, -0.902679979801178, 0.30191001296043396, -0.8986200094223022], [-0.03353700041770935, 0.47536998987197876, -0.6874600052833557, -0.726610004901886, 0.8402799963951111, 0.6430400013923645, -0.7597500085830688, 0.632420003414154, -0.5417600274085999, 0.11631999909877777, -0.20253999531269073, 0.6332100033760071, -1.267699956893921, -0.17674000561237335, 0.35284000635147095, -0.5509600043296814, -0.6502500176429749, -0.34049999713897705, -0.31657999753952026, -0.0779080018401146, -0.11084999889135361, 0.9729899764060974, -0.016844000667333603, -0.7375199794769287, 0.478520005941391, -2.706899881362915, -0.42416998744010925, -0.05348899960517883, 0.018466999754309654, -0.11891999840736389, 3.308199882507324, 0.1786399930715561, -0.5070199966430664, -0.2289399951696396, 0.24177999794483185, 0.5698000192642212, 0.0971129983663559, 0.9542199969291687, 0.007609299849718809, -0.5415400266647339, 0.09827999770641327, 0.4153299927711487, -1.1160000562667847, 0.005095399916172028, -0.1497499942779541, -0.4513300061225891, -0.08118800073862076, -0.6217300295829773, -0.022628000006079674, -0.4383000135421753], [0.6464200019836426, -0.5559999942779541, 0.4703800082206726, -0.8207399845123291, 0.7951200008392334, 0.2877100110054016, -0.5642600059509277, 0.14630000293254852, -0.5242099761962891, 0.02160700038075447, -0.1126599982380867, 0.3198600113391876, -0.05754199996590614, -0.23375000059604645, 0.6370300054550171, 0.33820000290870667, 0.4648999869823456, -0.4239799976348877, 0.09186799824237823, -0.8804000020027161, 0.220770001411438, 0.7127000093460083, 0.9819599986076355, -0.03381900116801262, 0.31553998589515686, -1.8000999689102173, -0.26003000140190125, -0.37762001156806946, 0.8563399910926819, -1.3393000364303589, 3.6407999992370605, 0.872730016708374, -0.7922999858856201, -0.5126799941062927, 0.1441500037908554, 0.554390013217926, 0.1005999967455864, 0.1323300004005432, -0.0719040036201477, -0.16399000585079193, -0.08998899906873703, -0.03193200007081032, 0.6139000058174133, 0.4041900038719177, 0.22686000168323517, -0.18974000215530396, -0.5540300011634827, -0.3583100140094757, -0.1099499985575676, -0.44699999690055847], 